**Полезные команды для работы с Git**

1. Клонирование репозитория - **git clone**
2. Работа с изменениями - **git pull**
3. Посмотреть статус файлов - **git status**
4. Добавление всех новых файлов - **git add .**
5. Добавить коммит - **git commit -m "Комментарий к коммиту".**
6. Посмотреть историю коммитов - **git log**

**3 факта о любимом сайте всех разработчиков GitHub**

**1.** До GitHub у его сооснователей были провальные проекты. Они пытались делать Famspam — социальная сеть для того, чтобы «оставаться в контакте со своей семьей», с почтой и календарем для встреч. Она оказалась финансово полностью несостоятельной — ведь ее функции отлично дублировал Facebook. Уонстрат, выступая на MIT Startup Bootcamp, рассказывал, что за первые месяцы работы сети удалось заработать целых $12.
**2.** GitHub, в свою очередь, уже через пару лет после запуска был прибыльным. «Мы больше не хотим, чтобы нас называли стартапом, ведь мы уже получаем прибыль… Мы взяли эту ужасную, неоригинальную, невдохновляющую идею и превратили ее в прибыльную компанию», — говорил Уонстрат в 2010 году — тогда сервис зарабатывал миллионы долларов в год.*https://youtu.be/zEYjJoF2RAY*
**3.** Сервис основан на Git — свободно доступной системой управления версиями софта, созданной Линусом Торвальдсом для совместной работы над кодом в Linux. У Линуса есть профиль на GitHub (вот он), где в том числе хранится копия ядра Linux. Занятно, что еще в 2012 году легендарный разработчик объяснял, что не принимает пулл-реквесты (просто говоря — патчи или багфиксы, предложения по улучшению кода) на GitHub: платформа отлично подходит для хостинга, а вот для пулл-реквестов — не очень, мол, в оригинальном Git это работает лучше.